<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Function id="_345" name="__builtin_cosh" returns="_370" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_370" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_346" name="__builtin_cosl" returns="_373" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_373" location="f0:44" file="f0" line="44"/>
  </Function>
  <Function id="_347" name="_IO_padn" returns="_203" context="_1" location="f2:468" file="f2" line="468" extern="1">
    <Argument type="_381" location="f2:468" file="f2" line="468"/>
    <Argument type="_166" location="f2:468" file="f2" line="468"/>
    <Argument type="_203" location="f2:468" file="f2" line="468"/>
  </Function>
  <Function id="_348" name="flockfile" returns="_39" throw="" context="_1" location="f1:913" file="f1" line="913" extern="1">
    <Argument name="__stream" type="_375" location="f1:913" file="f1" line="913"/>
  </Function>
  <Function id="_349" name="fgetpos64" returns="_166" context="_1" location="f1:820" file="f1" line="820" extern="1">
    <Argument name="__stream" type="_375r" location="f1:820" file="f1" line="820"/>
    <Argument name="__pos" type="_479r" location="f1:820" file="f1" line="820"/>
  </Function>
  <Typedef id="_350" name="__syscall_ulong_t" type="_44" context="_1" location="f3:177" file="f3" line="177"/>
  <Function id="_351" name="vscanf" returns="_166" context="_1" location="f1:480" file="f1" line="480" extern="1" attributes="nothrow __format__(,,) nonnull() format(,,)">
    <Argument name="__format" type="_371r" location="f1:480" file="f1" line="480"/>
    <Argument name="__arg" type="_377" location="f1:480" file="f1" line="480"/>
  </Function>
  <Function id="_352" name="__builtin_isgreater" returns="_374" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Typedef id="_353" name="__blksize_t" type="_50" context="_1" location="f3:153" file="f3" line="153"/>
  <Function id="_354" name="fgetc" returns="_166" context="_1" location="f1:531" file="f1" line="531" extern="1">
    <Argument name="__stream" type="_375" location="f1:531" file="f1" line="531"/>
  </Function>
  <Function id="_355" name="fgets" returns="_368" context="_1" location="f1:622" file="f1" line="622" extern="1">
    <Argument name="__s" type="_368r" location="f1:622" file="f1" line="622"/>
    <Argument name="__n" type="_166" location="f1:622" file="f1" line="622"/>
    <Argument name="__stream" type="_375r" location="f1:622" file="f1" line="622"/>
  </Function>
  <Typedef id="_356" name="__syscall_slong_t" type="_50" context="_1" location="f3:175" file="f3" line="175"/>
  <Function id="_357" name="__builtin_bswap32" returns="_46" context="_1" location="f0:157" file="f0" line="157" extern="1">
    <Argument name="_data" type="_46" location="f0:157" file="f0" line="157"/>
  </Function>
  <Function id="_358" name="__builtin_sinf" returns="_372" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_372" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_359" name="__builtin_sinh" returns="_370" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_370" location="f0:77" file="f0" line="77"/>
  </Function>
  <Typedef id="_360" name="__io_read_fn" type="_192" context="_1" location="f2:338" file="f2" line="338"/>
  <Function id="_361" name="__builtin_sinl" returns="_373" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_373" location="f0:80" file="f0" line="80"/>
  </Function>
  <Function id="_362" name="__builtin_csin" returns="_396" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_396" location="f0:115" file="f0" line="115"/>
  </Function>
  <Typedef id="_363" name="__clock_t" type="_50" context="_1" location="f3:135" file="f3" line="135"/>
  <Function id="_364" name="_IO_vfscanf" returns="_166" context="_1" location="f2:465" file="f2" line="465" extern="1">
    <Argument type="_381r" location="f2:465" file="f2" line="465"/>
    <Argument type="_371r" location="f2:465" file="f2" line="465"/>
    <Argument type="_377" location="f2:465" file="f2" line="465"/>
    <Argument type="_441r" location="f2:465" file="f2" line="465"/>
  </Function>
  <Function id="_365" name="_IO_ftrylockfile" returns="_166" throw="" context="_1" location="f2:447" file="f2" line="447" extern="1">
    <Argument type="_381" location="f2:447" file="f2" line="447"/>
  </Function>
  <Typedef id="_366" name="__int32_t" type="_166" context="_1" location="f3:40" file="f3" line="40"/>
  <Typedef id="_367" name="__io_write_fn" type="_111" context="_1" location="f2:347" file="f2" line="347"/>
  <PointerType id="_368" type="_482" size="64" align="64"/>
  <Typedef id="_369" name="__caddr_t" type="_368" context="_1" location="f3:183" file="f3" line="183"/>
  <FundamentalType id="_370" name="double" size="64" align="64"/>
  <PointerType id="_371" type="_482c" size="64" align="64"/>
  <FundamentalType id="_372" name="float" size="32" align="32"/>
  <FundamentalType id="_373" name="long double" size="128" align="128"/>
  <FundamentalType id="_374" name="bool" size="8" align="8"/>
  <PointerType id="_375" type="_218" size="64" align="64"/>
  <CvQualifiedType id="_371r" type="_371" restrict="1"/>
  <PointerType id="_377" type="_440" size="64" align="64"/>
  <FundamentalType id="_378" name="long long int" size="64" align="64"/>
  <FundamentalType id="_379" name="complex float" size="64" align="32"/>
  <FundamentalType id="_380" name="complex long double" size="256" align="128"/>
  <PointerType id="_381" type="_60" size="64" align="64"/>
  <CvQualifiedType id="_368r" type="_368" restrict="1"/>
  <Field id="_383" name="read" type="_484" offset="0" context="_25" access="public" location="f2:371" file="f2" line="371"/>
  <Field id="_384" name="write" type="_485" offset="64" context="_25" access="public" location="f2:372" file="f2" line="372"/>
  <Field id="_385" name="seek" type="_486" offset="128" context="_25" access="public" location="f2:373" file="f2" line="373"/>
  <Field id="_386" name="close" type="_487" offset="192" context="_25" access="public" location="f2:374" file="f2" line="374"/>
  <Destructor id="_387" name="._5" artificial="1" throw="" context="_25" access="public" mangled="_ZN25_IO_cookie_io_functions_tD1Ev *INTERNAL* " demangled="_IO_cookie_io_functions_t::~_IO_cookie_io_functions_t()" location="f2:375" file="f2" line="375" endline="375" inline="1">
  </Destructor>
  <OperatorMethod id="_388" name="=" returns="_488" artificial="1" throw="" context="_25" access="public" mangled="_ZN25_IO_cookie_io_functions_taSERKS_" demangled="_IO_cookie_io_functions_t::operator=(_IO_cookie_io_functions_t const&amp;)" location="f2:375" file="f2" line="375" endline="375" inline="1">
    <Argument type="_489" location="f2:370" file="f2" line="370"/>
  </OperatorMethod>
  <Constructor id="_389" name="._5" artificial="1" throw="" context="_25" access="public" mangled="_ZN25_IO_cookie_io_functions_tC1ERKS_ *INTERNAL* " demangled="_IO_cookie_io_functions_t::_IO_cookie_io_functions_t(_IO_cookie_io_functions_t const&amp;)" location="f2:375" file="f2" line="375" endline="375" inline="1">
    <Argument type="_489" location="f2:370" file="f2" line="370"/>
  </Constructor>
  <Constructor id="_390" name="._5" artificial="1" throw="" context="_25" access="public" mangled="_ZN25_IO_cookie_io_functions_tC1Ev *INTERNAL* " demangled="_IO_cookie_io_functions_t::_IO_cookie_io_functions_t()" location="f2:375" file="f2" line="375" inline="1"/>
  <PointerType id="_391" type="_24" size="64" align="64"/>
  <CvQualifiedType id="_391r" type="_391" restrict="1"/>
  <CvQualifiedType id="_375r" type="_375" restrict="1"/>
  <PointerType id="_394" type="_368" size="64" align="64"/>
  <CvQualifiedType id="_394r" type="_394" restrict="1"/>
  <FundamentalType id="_396" name="complex double" size="128" align="64"/>
  <PointerType id="_397" type="_252" size="64" align="64"/>
  <CvQualifiedType id="_397r" type="_397" restrict="1"/>
  <Field id="_399" name="_flags" type="_166" offset="0" context="_60" access="public" location="f2:246" file="f2" line="246"/>
  <Field id="_400" name="_IO_read_ptr" type="_368" offset="64" context="_60" access="public" location="f2:251" file="f2" line="251"/>
  <Field id="_401" name="_IO_read_end" type="_368" offset="128" context="_60" access="public" location="f2:252" file="f2" line="252"/>
  <Field id="_402" name="_IO_read_base" type="_368" offset="192" context="_60" access="public" location="f2:253" file="f2" line="253"/>
  <Field id="_403" name="_IO_write_base" type="_368" offset="256" context="_60" access="public" location="f2:254" file="f2" line="254"/>
  <Field id="_404" name="_IO_write_ptr" type="_368" offset="320" context="_60" access="public" location="f2:255" file="f2" line="255"/>
  <Field id="_405" name="_IO_write_end" type="_368" offset="384" context="_60" access="public" location="f2:256" file="f2" line="256"/>
  <Field id="_406" name="_IO_buf_base" type="_368" offset="448" context="_60" access="public" location="f2:257" file="f2" line="257"/>
  <Field id="_407" name="_IO_buf_end" type="_368" offset="512" context="_60" access="public" location="f2:258" file="f2" line="258"/>
  <Field id="_408" name="_IO_save_base" type="_368" offset="576" context="_60" access="public" location="f2:260" file="f2" line="260"/>
  <Field id="_409" name="_IO_backup_base" type="_368" offset="640" context="_60" access="public" location="f2:261" file="f2" line="261"/>
  <Field id="_410" name="_IO_save_end" type="_368" offset="704" context="_60" access="public" location="f2:262" file="f2" line="262"/>
  <Field id="_411" name="_markers" type="_490" offset="768" context="_60" access="public" location="f2:264" file="f2" line="264"/>
  <Field id="_412" name="_chain" type="_381" offset="832" context="_60" access="public" location="f2:266" file="f2" line="266"/>
  <Field id="_413" name="_fileno" type="_166" offset="896" context="_60" access="public" location="f2:268" file="f2" line="268"/>
  <Field id="_414" name="_flags2" type="_166" offset="928" context="_60" access="public" location="f2:272" file="f2" line="272"/>
  <Field id="_415" name="_old_offset" type="_233" offset="960" context="_60" access="public" location="f2:274" file="f2" line="274"/>
  <Field id="_416" name="_cur_column" type="_99" offset="1024" context="_60" access="public" location="f2:278" file="f2" line="278"/>
  <Field id="_417" name="_vtable_offset" type="_135" offset="1040" context="_60" access="public" location="f2:279" file="f2" line="279"/>
  <Field id="_418" name="_shortbuf" type="_491" offset="1048" context="_60" access="public" location="f2:280" file="f2" line="280"/>
  <Field id="_419" name="_lock" type="_492" offset="1088" context="_60" access="public" location="f2:284" file="f2" line="284"/>
  <Field id="_420" name="_offset" type="_293" offset="1152" context="_60" access="public" location="f2:293" file="f2" line="293"/>
  <Field id="_421" name="__pad1" type="_290" offset="1216" context="_60" access="public" location="f2:302" file="f2" line="302"/>
  <Field id="_422" name="__pad2" type="_290" offset="1280" context="_60" access="public" location="f2:303" file="f2" line="303"/>
  <Field id="_423" name="__pad3" type="_290" offset="1344" context="_60" access="public" location="f2:304" file="f2" line="304"/>
  <Field id="_424" name="__pad4" type="_290" offset="1408" context="_60" access="public" location="f2:305" file="f2" line="305"/>
  <Field id="_425" name="__pad5" type="_252" offset="1472" context="_60" access="public" location="f2:306" file="f2" line="306"/>
  <Field id="_426" name="_mode" type="_166" offset="1536" context="_60" access="public" location="f2:308" file="f2" line="308"/>
  <Field id="_427" name="_unused2" type="_493" offset="1568" context="_60" access="public" location="f2:310" file="f2" line="310"/>
  <Destructor id="_428" name="_IO_FILE" artificial="1" throw="" context="_60" access="public" mangled="_ZN8_IO_FILED1Ev *INTERNAL* " demangled="_IO_FILE::~_IO_FILE()" location="f2:245" file="f2" line="245" endline="245" inline="1">
  </Destructor>
  <OperatorMethod id="_429" name="=" returns="_494" artificial="1" throw="" context="_60" access="public" mangled="_ZN8_IO_FILEaSERKS_" demangled="_IO_FILE::operator=(_IO_FILE const&amp;)" location="f2:245" file="f2" line="245" endline="245" inline="1">
    <Argument type="_495" location="f2:245" file="f2" line="245"/>
  </OperatorMethod>
  <Constructor id="_430" name="_IO_FILE" artificial="1" throw="" context="_60" access="public" mangled="_ZN8_IO_FILEC1ERKS_ *INTERNAL* " demangled="_IO_FILE::_IO_FILE(_IO_FILE const&amp;)" location="f2:245" file="f2" line="245" endline="245" inline="1">
    <Argument type="_495" location="f2:245" file="f2" line="245"/>
  </Constructor>
  <Constructor id="_431" name="_IO_FILE" artificial="1" throw="" context="_60" access="public" mangled="_ZN8_IO_FILEC1Ev *INTERNAL* " demangled="_IO_FILE::_IO_FILE()" location="f2:245" file="f2" line="245" inline="1"/>
  <PointerType id="_432" type="_39c" size="64" align="64"/>
  <CvQualifiedType id="_432r" type="_432" restrict="1"/>
  <Field id="_434" name="__pos" type="_233" offset="0" context="_123" access="public" location="f5:23" file="f5" line="23"/>
  <Field id="_435" name="__state" type="_177" offset="64" context="_123" access="public" location="f5:24" file="f5" line="24"/>
  <Destructor id="_436" name="._3" artificial="1" throw="" context="_123" access="public" mangled="_ZN9_G_fpos_tD1Ev *INTERNAL* " demangled="_G_fpos_t::~_G_fpos_t()" location="f5:25" file="f5" line="25" endline="25" inline="1">
  </Destructor>
  <OperatorMethod id="_437" name="=" returns="_497" artificial="1" throw="" context="_123" access="public" mangled="_ZN9_G_fpos_taSERKS_" demangled="_G_fpos_t::operator=(_G_fpos_t const&amp;)" location="f5:25" file="f5" line="25" endline="25" inline="1">
    <Argument type="_498" location="f5:22" file="f5" line="22"/>
  </OperatorMethod>
  <Constructor id="_438" name="._3" artificial="1" throw="" context="_123" access="public" mangled="_ZN9_G_fpos_tC1ERKS_ *INTERNAL* " demangled="_G_fpos_t::_G_fpos_t(_G_fpos_t const&amp;)" location="f5:25" file="f5" line="25" endline="25" inline="1">
    <Argument type="_498" location="f5:22" file="f5" line="22"/>
  </Constructor>
  <Constructor id="_439" name="._3" artificial="1" throw="" context="_123" access="public" mangled="_ZN9_G_fpos_tC1Ev *INTERNAL* " demangled="_G_fpos_t::_G_fpos_t()" location="f5:25" file="f5" line="25" inline="1"/>
  <Struct id="_440" name="__va_list_tag" context="_1" mangled="13__va_list_tag" demangled="__va_list_tag" location="f10:0" file="f10" line="0" size="192" align="64" members=""/>
  <PointerType id="_441" type="_166" size="64" align="64"/>
  <ArrayType id="_442" min="0" max="" type="_371" align="64"/>
  <CvQualifiedType id="_442c" type="_442" const="1"/>
  <PointerType id="_444" type="_301" size="64" align="64"/>
  <CvQualifiedType id="_444r" type="_444" restrict="1"/>
  <Field id="_446" name="__pos" type="_293" offset="0" context="_144" access="public" location="f5:28" file="f5" line="28"/>
  <Field id="_447" name="__state" type="_177" offset="64" context="_144" access="public" location="f5:29" file="f5" line="29"/>
  <Destructor id="_448" name="._4" artificial="1" throw="" context="_144" access="public" mangled="_ZN11_G_fpos64_tD1Ev *INTERNAL* " demangled="_G_fpos64_t::~_G_fpos64_t()" location="f5:30" file="f5" line="30" endline="30" inline="1">
  </Destructor>
  <OperatorMethod id="_449" name="=" returns="_499" artificial="1" throw="" context="_144" access="public" mangled="_ZN11_G_fpos64_taSERKS_" demangled="_G_fpos64_t::operator=(_G_fpos64_t const&amp;)" location="f5:30" file="f5" line="30" endline="30" inline="1">
    <Argument type="_500" location="f5:27" file="f5" line="27"/>
  </OperatorMethod>
  <Constructor id="_450" name="._4" artificial="1" throw="" context="_144" access="public" mangled="_ZN11_G_fpos64_tC1ERKS_ *INTERNAL* " demangled="_G_fpos64_t::_G_fpos64_t(_G_fpos64_t const&amp;)" location="f5:30" file="f5" line="30" endline="30" inline="1">
    <Argument type="_500" location="f5:27" file="f5" line="27"/>
  </Constructor>
  <Constructor id="_451" name="._4" artificial="1" throw="" context="_144" access="public" mangled="_ZN11_G_fpos64_tC1Ev *INTERNAL* " demangled="_G_fpos64_t::_G_fpos64_t()" location="f5:30" file="f5" line="30" inline="1"/>
  <PointerType id="_452" type="_372" size="64" align="64"/>
  <PointerType id="_453" type="_373" size="64" align="64"/>
  <Field id="_454" name="__count" type="_166" offset="0" context="_177" access="public" location="f7:84" file="f7" line="84"/>
  <Field id="_455" name="__value" type="_456" offset="32" context="_177" access="public" location="f7:93" file="f7" line="93"/>
  <Union id="_456" context="_177" access="public" mangled="N11__mbstate_t3._2E" demangled="__mbstate_t::._2" location="f7:86" file="f7" line="86" artificial="1" size="32" align="32" members="_501 _502 _503 _504 _505 _506 " bases=""/>
  <Destructor id="_457" name="._1" artificial="1" throw="" context="_177" access="public" mangled="_ZN11__mbstate_tD1Ev *INTERNAL* " demangled="__mbstate_t::~__mbstate_t()" location="f7:94" file="f7" line="94" endline="94" inline="1">
  </Destructor>
  <OperatorMethod id="_458" name="=" returns="_507" artificial="1" throw="" context="_177" access="public" mangled="_ZN11__mbstate_taSERKS_" demangled="__mbstate_t::operator=(__mbstate_t const&amp;)" location="f7:94" file="f7" line="94" endline="94" inline="1">
    <Argument type="_508" location="f7:83" file="f7" line="83"/>
  </OperatorMethod>
  <Constructor id="_459" name="._1" artificial="1" throw="" context="_177" access="public" mangled="_ZN11__mbstate_tC1ERKS_ *INTERNAL* " demangled="__mbstate_t::__mbstate_t(__mbstate_t const&amp;)" location="f7:94" file="f7" line="94" endline="94" inline="1">
    <Argument type="_508" location="f7:83" file="f7" line="83"/>
  </Constructor>
  <Constructor id="_460" name="._1" artificial="1" throw="" context="_177" access="public" mangled="_ZN11__mbstate_tC1Ev *INTERNAL* " demangled="__mbstate_t::__mbstate_t()" location="f7:94" file="f7" line="94" inline="1"/>
  <PointerType id="_461" type="_301c" size="64" align="64"/>
  <CvQualifiedType id="_381r" type="_381" restrict="1"/>
  <PointerType id="_463" type="_145c" size="64" align="64"/>
  <Field id="_464" name="__val" type="_511" offset="0" context="_230" access="public" location="f3:134" file="f3" line="134"/>
  <Destructor id="_465" name="._0" artificial="1" throw="" context="_230" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f3:134" file="f3" line="134" endline="134" inline="1">
  </Destructor>
  <OperatorMethod id="_466" name="=" returns="_512" artificial="1" throw="" context="_230" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f3:134" file="f3" line="134" endline="134" inline="1">
    <Argument type="_513" location="f3:134" file="f3" line="134"/>
  </OperatorMethod>
  <Constructor id="_467" name="._0" artificial="1" throw="" context="_230" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f3:134" file="f3" line="134" endline="134" inline="1">
    <Argument type="_513" location="f3:134" file="f3" line="134"/>
  </Constructor>
  <Constructor id="_468" name="._0" artificial="1" throw="" context="_230" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f3:134" file="f3" line="134" inline="1"/>
  <Field id="_469" name="_next" type="_490" offset="0" context="_234" access="public" location="f2:161" file="f2" line="161"/>
  <Field id="_470" name="_sbuf" type="_381" offset="64" context="_234" access="public" location="f2:162" file="f2" line="162"/>
  <Field id="_471" name="_pos" type="_166" offset="128" context="_234" access="public" location="f2:166" file="f2" line="166"/>
  <Destructor id="_472" name="_IO_marker" artificial="1" throw="" context="_234" access="public" mangled="_ZN10_IO_markerD1Ev *INTERNAL* " demangled="_IO_marker::~_IO_marker()" location="f2:160" file="f2" line="160" endline="160" inline="1">
  </Destructor>
  <OperatorMethod id="_473" name="=" returns="_514" artificial="1" throw="" context="_234" access="public" mangled="_ZN10_IO_markeraSERKS_" demangled="_IO_marker::operator=(_IO_marker const&amp;)" location="f2:160" file="f2" line="160" endline="160" inline="1">
    <Argument type="_515" location="f2:160" file="f2" line="160"/>
  </OperatorMethod>
  <Constructor id="_474" name="_IO_marker" artificial="1" throw="" context="_234" access="public" mangled="_ZN10_IO_markerC1ERKS_ *INTERNAL* " demangled="_IO_marker::_IO_marker(_IO_marker const&amp;)" location="f2:160" file="f2" line="160" endline="160" inline="1">
    <Argument type="_515" location="f2:160" file="f2" line="160"/>
  </Constructor>
  <Constructor id="_475" name="_IO_marker" artificial="1" throw="" context="_234" access="public" mangled="_ZN10_IO_markerC1Ev *INTERNAL* " demangled="_IO_marker::_IO_marker()" location="f2:160" file="f2" line="160" inline="1"/>
  <PointerType id="_476" type="_293" size="64" align="64"/>
  <CvQualifiedType id="_290r" type="_290" restrict="1"/>
  <PointerType id="_478" type="_326" size="64" align="64"/>
  <PointerType id="_479" type="_145" size="64" align="64"/>
  <CvQualifiedType id="_479r" type="_479" restrict="1"/>
  <CvQualifiedType id="_441r" type="_441" restrict="1"/>
  <PointerType id="_484" type="_360" size="64" align="64"/>
  <PointerType id="_485" type="_367" size="64" align="64"/>
  <PointerType id="_486" type="_265" size="64" align="64"/>
  <PointerType id="_487" type="_88" size="64" align="64"/>
  <ReferenceType id="_488" type="_25" size="64" align="64"/>
  <ReferenceType id="_489" type="_25c" size="64" align="64"/>
  <PointerType id="_490" type="_234" size="64" align="64"/>
  <ArrayType id="_491" min="0" max="0u" type="_482" size="8" align="8"/>
  <PointerType id="_492" type="_40" size="64" align="64"/>
  <ArrayType id="_493" min="0" max="19u" type="_482" size="160" align="8"/>
  <ReferenceType id="_494" type="_60" size="64" align="64"/>
  <ReferenceType id="_495" type="_60c" size="64" align="64"/>
  <ReferenceType id="_497" type="_123" size="64" align="64"/>
  <ReferenceType id="_498" type="_123c" size="64" align="64"/>
  <ReferenceType id="_499" type="_144" size="64" align="64"/>
  <ReferenceType id="_500" type="_144c" size="64" align="64"/>
  <Field id="_501" name="__wch" type="_46" offset="0" context="_456" access="public" location="f7:88" file="f7" line="88"/>
  <Field id="_502" name="__wchb" type="_520" offset="0" context="_456" access="public" location="f7:92" file="f7" line="92"/>
  <Destructor id="_503" name="._2" artificial="1" throw="" context="_456" access="public" mangled="_ZN11__mbstate_t3._2D1Ev *INTERNAL* " demangled="__mbstate_t::._2::~._2()" location="f7:86" file="f7" line="86" endline="86" inline="1">
  </Destructor>
  <OperatorMethod id="_504" name="=" returns="_521" artificial="1" throw="" context="_456" access="public" mangled="_ZN11__mbstate_t3._2aSERKS0_" demangled="__mbstate_t::._2::operator=(__mbstate_t::._2 const&amp;)" location="f7:86" file="f7" line="86" endline="86" inline="1">
    <Argument type="_522" location="f7:86" file="f7" line="86"/>
  </OperatorMethod>
  <Constructor id="_505" artificial="1" throw="" context="_456" access="public" mangled="_ZN11__mbstate_t3._2C1ERKS0_ *INTERNAL* " demangled="__mbstate_t::._2::._2(__mbstate_t::._2 const&amp;)" location="f7:86" file="f7" line="86" endline="86" inline="1">
    <Argument type="_522" location="f7:86" file="f7" line="86"/>
  </Constructor>
  <Constructor id="_506" artificial="1" throw="" context="_456" access="public" mangled="_ZN11__mbstate_t3._2C1Ev *INTERNAL* " demangled="__mbstate_t::._2::._2()" location="f7:86" file="f7" line="86" inline="1"/>
  <ReferenceType id="_507" type="_177" size="64" align="64"/>
  <ReferenceType id="_508" type="_177c" size="64" align="64"/>
  <ArrayType id="_511" min="0" max="1u" type="_166" size="64" align="32"/>
  <ReferenceType id="_512" type="_230" size="64" align="64"/>
  <ReferenceType id="_513" type="_230c" size="64" align="64"/>
  <ReferenceType id="_514" type="_234" size="64" align="64"/>
  <ReferenceType id="_515" type="_234c" size="64" align="64"/>
  <FundamentalType id="_482" name="char" size="8" align="8"/>
  <ArrayType id="_520" min="0" max="3u" type="_482" size="32" align="8"/>
  <ReferenceType id="_521" type="_456" size="64" align="64"/>
  <ReferenceType id="_522" type="_456c" size="64" align="64"/>
  <CvQualifiedType id="_482c" type="_482" const="1"/>
  <CvQualifiedType id="_39c" type="_39" const="1"/>
  <CvQualifiedType id="_230c" type="_230" const="1"/>
  <CvQualifiedType id="_456c" type="_456" const="1"/>
  <CvQualifiedType id="_177c" type="_177" const="1"/>
  <CvQualifiedType id="_123c" type="_123" const="1"/>
  <CvQualifiedType id="_144c" type="_144" const="1"/>
  <CvQualifiedType id="_234c" type="_234" const="1"/>
  <CvQualifiedType id="_60c" type="_60" const="1"/>
  <CvQualifiedType id="_25c" type="_25" const="1"/>
  <CvQualifiedType id="_301c" type="_301" const="1"/>
  <CvQualifiedType id="_145c" type="_145" const="1"/>
  <File id="f0" name="/usr/local/share/gccxml-0.9/GCC/4.8/gccxml_builtins.h"/>
  <File id="f1" name="/usr/include/stdio.h"/>
  <File id="f2" name="/usr/include/libio.h"/>
  <File id="f3" name="/usr/include/x86_64-linux-gnu/bits/types.h"/>
  <File id="f4" name="hello.c"/>
  <File id="f5" name="/usr/include/_G_config.h"/>
  <File id="f6" name="/usr/include/x86_64-linux-gnu/bits/sys_errlist.h"/>
  <File id="f7" name="/usr/include/wchar.h"/>
  <File id="f8" name="/usr/lib/gcc/x86_64-linux-gnu/4.8/include/stddef.h"/>
  <File id="f9" name="/usr/lib/gcc/x86_64-linux-gnu/4.8/include/stdarg.h"/>
  <File id="f10" name="&lt;built-in&gt;"/>
</GCC_XML>
